Import neccesory libraries

In [142]:
import numpy as np
import pandas as pd

Data Exploring

In [143]:
data = pd.read_csv(r'/teamspace/studios/this_studio/Data-Science---Practices/data/house_prices.csv')
data.head()

,Index,Title,Description,Amount(in rupees),Price (in rupees),location,Carpet Area,Status,Floor,Transaction,...,facing,overlooking,Society,Bathroom,Balcony,Car Parking,Ownership,Super Area,Dimensions,Plot Area
0,0,1 BHK Ready to Occupy Flat for sale in Srushti...,"Bhiwandi, Thane has an attractive 1 BHK Flat f...",42 Lac,6000.0,thane,500 sqft,Ready to Move,10 out of 11,Resale,...,NaN,NaN,Srushti Siddhi Mangal Murti Complex,1,2,NaN,NaN,NaN,NaN,NaN
1,1,2 BHK Ready to Occupy Flat for sale in Dosti V...,One can find this stunning 2 BHK flat for sale...,98 Lac,13799.0,thane,473 sqft,Ready to Move,3 out of 22,Resale,...,East,Garden/Park,Dosti Vihar,2,NaN,1 Open,Freehold,NaN,NaN,NaN
2,2,2 BHK Ready to Occupy Flat for sale in Sunrise...,Up for immediate sale is a 2 BHK apartment in ...,1.40 Cr,17500.0,thane,779 sqft,Ready to Move,10 out of 29,Resale,...,East,Garden/Park,Sunrise by Kalpataru,2,NaN,1 Covered,Freehold,NaN,NaN,NaN
3,3,1 BHK Ready to Occupy Flat for sale Kasheli,This beautiful 1 BHK Flat is available for sal...,25 Lac,NaN,thane,530 sqft,Ready to Move,1 out of 3,Resale,...,NaN,NaN,NaN,1,1,NaN,NaN,NaN,NaN,NaN
4,4,2 BHK Ready to Occupy Flat for sale in TenX Ha...,"This lovely 2 BHK Flat in Pokhran Road, Thane ...",1.60 Cr,18824.0,thane,635 sqft,Ready to Move,20 out of 42,Resale,...,West,"Garden/Park, Main Road",TenX Habitat Raymond Realty,2,NaN,1 Covered,Co-operative Society,NaN,NaN,NaN

In [144]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187531 entries, 0 to 187530
Data columns (total 21 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Index              187531 non-null  int64
 1   Title              187531 non-null  object
 2   Description        184508 non-null  object
 3   Amount(in rupees)  187531 non-null  object
 4   Price (in rupees)  169866 non-null  float64
 5   location           187531 non-null  object
 6   Carpet Area        106858 non-null  object
 7   Status             186916 non-null  object
 8   Floor              180454 non-null  object
 9   Transaction        187448 non-null  object
 10  Furnishing         184634 non-null  object
 11  facing             117298 non-null  object
 12  overlooking        106095 non-null  object
 13  Society            77853 non-null   object
 14  Bathroom           186703 non-null  object
 15  Balcony            138596 non-null  object
 16  Car Parking        84174 non-null   object
 17  Ownership          122014 non-null  object
 18  Super Area         79846 non-null   object
 19  Dimensions         0 non-null       float64
 20  Plot Area          0 non-null       float64
dtypes: float64(3), int64(1), object(17)
memory usage: 30.0+ MB

In [145]:
data.describe()

               Index  Price (in rupees)  Dimensions  Plot Area
count  187531.000000       1.698660e+05         0.0        0.0
mean    93765.000000       7.583772e+03         NaN        NaN
std     54135.681003       2.724171e+04         NaN        NaN
min         0.000000       0.000000e+00         NaN        NaN
25%     46882.500000       4.297000e+03         NaN        NaN
50%     93765.000000       6.034000e+03         NaN        NaN
75%    140647.500000       9.450000e+03         NaN        NaN
max    187530.000000       6.700000e+06         NaN        NaN

In [146]:
data.isna().sum()

Index                     0
Title                     0
Description            3023
Amount(in rupees)         0
Price (in rupees)     17665
location                  0
Carpet Area           80673
Status                  615
Floor                  7077
Transaction              83
Furnishing             2897
facing                70233
overlooking           81436
Society              109678
Bathroom                828
Balcony               48935
Car Parking          103357
Ownership             65517
Super Area           107685
Dimensions           187531
Plot Area            187531
dtype: int64

In [147]:
data.columns

Index(['Index', 'Title', 'Description', 'Amount(in rupees)',
       'Price (in rupees)', 'location', 'Carpet Area', 'Status', 'Floor',
       'Transaction', 'Furnishing', 'facing', 'overlooking', 'Society',
       'Bathroom', 'Balcony', 'Car Parking', 'Ownership', 'Super Area',
       'Dimensions', 'Plot Area'],
      dtype='object')

In [148]:
data.shape

(187531, 21)

Categorical and Numerical veriables

In [149]:
cat_columns = data.select_dtypes(include=['object']).columns.tolist()

print( "Categorical columns are:", cat_columns)

Categorical columns are: ['Title', 'Description', 'Amount(in rupees)', 'location', 'Carpet Area', 'Status', 'Floor', 'Transaction', 'Furnishing', 'facing', 'overlooking', 'Society', 'Bathroom', 'Balcony', 'Car Parking', 'Ownership', 'Super Area']

In [150]:
num_column= data.select_dtypes(include=['int64', 'float64']).columns.tolist()
print("Numerical columns are:", num_column)

Numerical columns are: ['Index', 'Price (in rupees)', 'Dimensions', 'Plot Area']

In [151]:
data.columns

Index(['Index', 'Title', 'Description', 'Amount(in rupees)',
       'Price (in rupees)', 'location', 'Carpet Area', 'Status', 'Floor',
       'Transaction', 'Furnishing', 'facing', 'overlooking', 'Society',
       'Bathroom', 'Balcony', 'Car Parking', 'Ownership', 'Super Area',
       'Dimensions', 'Plot Area'],
      dtype='object')

## Handiling Null values

In [152]:
print("NUll values:", data.isna().sum())
print()
print("Shape of dataset:", data.shape)

NUll values: Index                     0
Title                     0
Description            3023
Amount(in rupees)         0
Price (in rupees)     17665
location                  0
Carpet Area           80673
Status                  615
Floor                  7077
Transaction              83
Furnishing             2897
facing                70233
overlooking           81436
Society              109678
Bathroom                828
Balcony               48935
Car Parking          103357
Ownership             65517
Super Area           107685
Dimensions           187531
Plot Area            187531
dtype: int64

Shape of dataset: (187531, 21)

In [153]:
# Remove Duplicate values
print("Number of duplicate values:", data.duplicated().sum())

#Remove duplicated values if present
data.drop_duplicates()
data.head(3)

Number of duplicate values: 0

,Index,Title,Description,Amount(in rupees),Price (in rupees),location,Carpet Area,Status,Floor,Transaction,...,facing,overlooking,Society,Bathroom,Balcony,Car Parking,Ownership,Super Area,Dimensions,Plot Area
0,0,1 BHK Ready to Occupy Flat for sale in Srushti...,"Bhiwandi, Thane has an attractive 1 BHK Flat f...",42 Lac,6000.0,thane,500 sqft,Ready to Move,10 out of 11,Resale,...,NaN,NaN,Srushti Siddhi Mangal Murti Complex,1,2,NaN,NaN,NaN,NaN,NaN
1,1,2 BHK Ready to Occupy Flat for sale in Dosti V...,One can find this stunning 2 BHK flat for sale...,98 Lac,13799.0,thane,473 sqft,Ready to Move,3 out of 22,Resale,...,East,Garden/Park,Dosti Vihar,2,NaN,1 Open,Freehold,NaN,NaN,NaN
2,2,2 BHK Ready to Occupy Flat for sale in Sunrise...,Up for immediate sale is a 2 BHK apartment in ...,1.40 Cr,17500.0,thane,779 sqft,Ready to Move,10 out of 29,Resale,...,East,Garden/Park,Sunrise by Kalpataru,2,NaN,1 Covered,Freehold,NaN,NaN,NaN

In [154]:
## Looking for unique values that present in Location , status, Transction, Furnishing, overlooking and Owership

columns = ['location', 'Status', 'Transaction', 'Furnishing', 'overlooking', 'Ownership']

for col in columns:
    print(f"{col} Unique values are:\n{data[col].unique()}\n\n Number of Unique values :{len(data[col].unique())}\n\nNumber of null values are present: {data[col].isna().sum()}\n")

location Unique values are:
['thane' 'navi-mumbai' 'nagpur' 'mumbai' 'ahmedabad' 'bangalore' 'chennai'
 'gurgaon' 'hyderabad' 'indore' 'jaipur' 'kolkata' 'lucknow' 'new-delhi'
 'noida' 'pune' 'agra' 'ahmadnagar' 'allahabad' 'aurangabad' 'badlapur'
 'belgaum' 'bhiwadi' 'bhiwandi' 'bhopal' 'bhubaneswar' 'chandigarh'
 'coimbatore' 'dehradun' 'durgapur' 'ernakulam' 'faridabad' 'ghaziabad'
 'goa' 'greater-noida' 'guntur' 'guwahati' 'gwalior' 'haridwar' 'jabalpur'
 'jamshedpur' 'jodhpur' 'kalyan' 'kanpur' 'kochi' 'kozhikode' 'ludhiana'
 'madurai' 'mangalore' 'mohali' 'mysore' 'nashik' 'navsari' 'nellore'
 'palakkad' 'palghar' 'panchkula' 'patna' 'pondicherry' 'raipur'
 'rajahmundry' 'ranchi' 'satara' 'shimla' 'siliguri' 'solapur' 'sonipat'
 'surat' 'thrissur' 'tirupati' 'trichy' 'trivandrum' 'udaipur' 'udupi'
 'vadodara' 'vapi' 'varanasi' 'vijayawada' 'visakhapatnam' 'vrindavan'
 'zirakpur']

 Number of Unique values :81

Number of null values are present: 0

Status Unique values are:
['Ready to Move' nan]

 Number of Unique values :2

Number of null values are present: 615

Transaction Unique values are:
['Resale' 'New Property' nan 'Other' 'Rent/Lease']

 Number of Unique values :5

Number of null values are present: 83

Furnishing Unique values are:
['Unfurnished' 'Semi-Furnished' 'Furnished' nan]

 Number of Unique values :4

Number of null values are present: 2897

overlooking Unique values are:
[nan 'Garden/Park' 'Garden/Park, Main Road' 'Main Road'
 'Pool, Garden/Park, Main Road' 'Garden/Park, Pool, Main Road'
 'Garden/Park, Pool' 'Main Road, Garden/Park'
 'Main Road, Garden/Park, Pool' 'Pool, Garden/Park' 'Pool'
 'Garden/Park, Main Road, Pool' 'Pool, Main Road'
 'Main Road, Pool, Garden/Park' 'Pool, Main Road, Garden/Park'
 'Main Road, Not Available' 'Main Road, Pool'
 'Garden/Park, Pool, Main Road, Not Available'
 'Garden/Park, Not Available' 'Pool, Main Road, Not Available']

 Number of Unique values :20

Number of null values are present: 81436

Ownership Unique values are:
[nan 'Freehold' 'Co-operative Society' 'Power Of Attorney' 'Leasehold']

 Number of Unique values :5

Number of null values are present: 65517

In [155]:
data.shape

(187531, 21)

In [156]:
data.isna().sum()

Index                     0
Title                     0
Description            3023
Amount(in rupees)         0
Price (in rupees)     17665
location                  0
Carpet Area           80673
Status                  615
Floor                  7077
Transaction              83
Furnishing             2897
facing                70233
overlooking           81436
Society              109678
Bathroom                828
Balcony               48935
Car Parking          103357
Ownership             65517
Super Area           107685
Dimensions           187531
Plot Area            187531
dtype: int64

In [157]:
# Drop columns with a high number of missing values
data.drop(columns=[ 'Society', 'Car Parking', 'Super Area', 'Dimensions', 'Plot Area'], inplace=True)

In [158]:
house_df =data.copy()

In [159]:
# 1. Fill null values in 'Description', 'Facing', 'Overlooking', and 'Ownership' with 'Unknown'
cols_to_fill_unknown = ['Description', 'facing', 'overlooking', 'Ownership']
house_df[cols_to_fill_unknown] = house_df[cols_to_fill_unknown].fillna('Unknown')

# 2. Fill null values in 'Price (in rupees)' with mean value
mean_price = house_df['Price (in rupees)'].mean()
house_df['Price (in rupees)'].fillna(mean_price, inplace=True)

# 3. Replace null values in 'Status', 'Transaction', and 'Furnishing' columns with mode
cols_to_fill_mode = ['Status', 'Transaction', 'Furnishing']
for col in cols_to_fill_mode:
    mode_val = house_df[col].mode().iloc[0]
    house_df[col].fillna(mode_val, inplace=True)

# 4. Convert 'Bathroom' and 'Balcony' columns to numeric form, including '>10'
house_df['Bathroom'] = pd.to_numeric(house_df['Bathroom'], errors='coerce')
house_df['Balcony'] = pd.to_numeric(house_df['Balcony'], errors='coerce')

# Fill NaN values in 'Bathroom' and 'Balcony' with the mean of their respective columns
mean_bathroom = house_df['Bathroom'].mean()
mean_balcony = house_df['Balcony'].mean()
house_df['Bathroom'].fillna(mean_bathroom, inplace=True)
house_df['Balcony'].fillna(mean_balcony, inplace=True)

# Convert >10 values in 'Bathroom' and 'Balcony' to their respective numeric forms
house_df.loc[house_df['Bathroom'] == '>10', 'Bathroom'] = 11
house_df['Bathroom'] = house_df['Bathroom'].astype(int)

house_df.loc[house_df['Balcony'] == '>10', 'Balcony'] = 11
house_df['Balcony'] = house_df['Balcony'].astype(int)

# Verify if all null values have been handled
print(house_df.isnull().sum())

/tmp/ipykernel_1710/3871230823.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  house_df['Price (in rupees)'].fillna(mean_price, inplace=True)
/tmp/ipykernel_1710/3871230823.py:13: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  house_df[col].fillna(mode_val, inplace=True)

Index                    0
Title                    0
Description              0
Amount(in rupees)        0
Price (in rupees)        0
location                 0
Carpet Area          80673
Status                   0
Floor                 7077
Transaction              0
Furnishing               0
facing                   0
overlooking              0
Bathroom                 0
Balcony                  0
Ownership                0
dtype: int64

/tmp/ipykernel_1710/3871230823.py:22: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  house_df['Bathroom'].fillna(mean_bathroom, inplace=True)
/tmp/ipykernel_1710/3871230823.py:23: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  house_df['Balcony'].fillna(mean_balcony, inplace=True)

In [160]:
data.head(3)

,Index,Title,Description,Amount(in rupees),Price (in rupees),location,Carpet Area,Status,Floor,Transaction,Furnishing,facing,overlooking,Bathroom,Balcony,Ownership
0,0,1 BHK Ready to Occupy Flat for sale in Srushti...,"Bhiwandi, Thane has an attractive 1 BHK Flat f...",42 Lac,6000.0,thane,500 sqft,Ready to Move,10 out of 11,Resale,Unfurnished,NaN,NaN,1,2,NaN
1,1,2 BHK Ready to Occupy Flat for sale in Dosti V...,One can find this stunning 2 BHK flat for sale...,98 Lac,13799.0,thane,473 sqft,Ready to Move,3 out of 22,Resale,Semi-Furnished,East,Garden/Park,2,NaN,Freehold
2,2,2 BHK Ready to Occupy Flat for sale in Sunrise...,Up for immediate sale is a 2 BHK apartment in ...,1.40 Cr,17500.0,thane,779 sqft,Ready to Move,10 out of 29,Resale,Unfurnished,East,Garden/Park,2,NaN,Freehold

In [161]:
# Impute missing values in 'Carpet Area' with mean
def convert_to_sqft(area):
    try:
        if pd.notnull(area):
            if 'sqft' in area:
                area = float(area.replace(' sqft', ''))
            else:
                area = float(area.replace(' sqm', '')) * 10.7639  # Convert square meters to square feet
            return area
    except ValueError:
        return np.nan

house_df['Carpet Area'] = house_df['Carpet Area'].apply(convert_to_sqft)

# Impute missing values in 'Carpet Area' with mean
mean_carpet_area = house_df['Carpet Area'].mean()
house_df['Carpet Area'].fillna(mean_carpet_area, inplace=True)

# Convert 'Carpet Area' back to a string with the 'sqft' suffix
house_df['Carpet Area'] = house_df['Carpet Area'].astype(int).astype(str) + ' sqft'

# Impute missing values in 'Floor' with mode (most frequent value)
mode_floor = house_df['Floor'].mode().iloc[0]
house_df['Floor'].fillna(mode_floor, inplace=True)

# Verify if all null values have been handled
print(house_df.isnull().sum())

/tmp/ipykernel_1710/3706438914.py:17: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  house_df['Carpet Area'].fillna(mean_carpet_area, inplace=True)
/tmp/ipykernel_1710/3706438914.py:24: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  house_df['Floor'].fillna(mode_floor, inplace=True)

Index                0
Title                0
Description          0
Amount(in rupees)    0
Price (in rupees)    0
location             0
Carpet Area          0
Status               0
Floor                0
Transaction          0
Furnishing           0
facing               0
overlooking          0
Bathroom             0
Balcony              0
Ownership            0
dtype: int64

In [162]:
df = house_df.copy()

In [163]:
df[['Amount(in rupees)','Carpet Area']]

       Amount(in rupees) Carpet Area
0                42 Lac     500 sqft
1                98 Lac     473 sqft
2               1.40 Cr     779 sqft
3                25 Lac     530 sqft
4               1.60 Cr     635 sqft
...                  ...         ...
187526           63 Lac    1267 sqft
187527           55 Lac    1267 sqft
187528           76 Lac    1250 sqft
187529           30 Lac    1267 sqft
187530          1.18 Cr    1267 sqft

[187531 rows x 2 columns]

In [164]:
# Convert 'Amount(in rupees)' to numerical format
def convert_amount(amount):
    try:
        if 'Lac' in amount:
            amount = amount.replace('Lac', '').strip()
            return float(amount) * 100000  # Convert Lac to rupees (1 Lac = 100000 rupees)
        elif 'Cr' in amount:
            amount = amount.replace('Cr', '').strip()
            return float(amount) * 10000000  # Convert Cr to rupees (1 Cr = 10000000 rupees)
        else:
            return float(amount)
    except ValueError:
        return None

df['Amount(in rupees)'] = df['Amount(in rupees)'].apply(convert_amount)

# Convert 'Carpet Area' to numerical format
def convert_carpet_area(area):
    try:
        if 'sqft' in area:
            area = area.replace('sqft', '').strip()
            return float(area)  # Convert to square feet
        elif 'sqm' in area:
            area = area.replace('sqm', '').strip()
            return float(area) * 10.7639  # Convert square meters to square feet (1 sqm = 10.7639 sqft)
        else:
            return None
    except ValueError:
        return None

df['Carpet Area'] = df['Carpet Area'].apply(convert_carpet_area)

# Rename the columns to reflect the converted units
df.rename(columns={'Amount(in rupees)': 'Amount in rupees', 'Carpet Area': 'Carpet Area in sqft'}, inplace=True)

# Verify the changes
df.head()

,Index,Title,Description,Amount in rupees,Price (in rupees),location,Carpet Area in sqft,Status,Floor,Transaction,Furnishing,facing,overlooking,Bathroom,Balcony,Ownership
0,0,1 BHK Ready to Occupy Flat for sale in Srushti...,"Bhiwandi, Thane has an attractive 1 BHK Flat f...",4200000.0,6000.000000,thane,500.0,Ready to Move,10 out of 11,Resale,Unfurnished,Unknown,Unknown,1,2,Unknown
1,1,2 BHK Ready to Occupy Flat for sale in Dosti V...,One can find this stunning 2 BHK flat for sale...,9800000.0,13799.000000,thane,473.0,Ready to Move,3 out of 22,Resale,Semi-Furnished,East,Garden/Park,2,2,Freehold
2,2,2 BHK Ready to Occupy Flat for sale in Sunrise...,Up for immediate sale is a 2 BHK apartment in ...,14000000.0,17500.000000,thane,779.0,Ready to Move,10 out of 29,Resale,Unfurnished,East,Garden/Park,2,2,Freehold
3,3,1 BHK Ready to Occupy Flat for sale Kasheli,This beautiful 1 BHK Flat is available for sal...,2500000.0,7583.771885,thane,530.0,Ready to Move,1 out of 3,Resale,Unfurnished,Unknown,Unknown,1,1,Unknown
4,4,2 BHK Ready to Occupy Flat for sale in TenX Ha...,"This lovely 2 BHK Flat in Pokhran Road, Thane ...",16000000.0,18824.000000,thane,635.0,Ready to Move,20 out of 42,Resale,Unfurnished,West,"Garden/Park, Main Road",2,2,Co-operative Society

In [165]:
df.describe()

,Index,Amount in rupees,Price (in rupees),Carpet Area in sqft,Bathroom,Balcony
count,187531.000000,1.778470e+05,1.875310e+05,187531.000000,187531.000000,187531.000000
mean,93765.000000,1.198134e+07,7.583772e+03,1267.520207,2.424676,2.000261
std,54135.681003,3.943827e+07,2.592692e+04,2301.537519,0.861739,0.817864
min,0.000000,1.000000e+05,0.000000e+00,1.000000,1.000000,1.000000
25%,46882.500000,4.840000e+06,4.501500e+03,1000.000000,2.000000,1.000000
50%,93765.000000,7.800000e+06,6.499000e+03,1267.000000,2.000000,2.000000
75%,140647.500000,1.450000e+07,8.452500e+03,1267.000000,3.000000,2.000000
max,187530.000000,1.400300e+10,6.700000e+06,709222.000000,10.000000,10.000000

In [166]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187531 entries, 0 to 187530
Data columns (total 16 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   Index                187531 non-null  int64
 1   Title                187531 non-null  object
 2   Description          187531 non-null  object
 3   Amount in rupees     177847 non-null  float64
 4   Price (in rupees)    187531 non-null  float64
 5   location             187531 non-null  object
 6   Carpet Area in sqft  187531 non-null  float64
 7   Status               187531 non-null  object
 8   Floor                187531 non-null  object
 9   Transaction          187531 non-null  object
 10  Furnishing           187531 non-null  object
 11  facing               187531 non-null  object
 12  overlooking          187531 non-null  object
 13  Bathroom             187531 non-null  int64
 14  Balcony              187531 non-null  int64
 15  Ownership            187531 non-null  object
dtypes: float64(3), int64(3), object(10)
memory usage: 22.9+ MB

In [167]:
df.isna().sum()

Index                     0
Title                     0
Description               0
Amount in rupees       9684
Price (in rupees)         0
location                  0
Carpet Area in sqft       0
Status                    0
Floor                     0
Transaction               0
Furnishing                0
facing                    0
overlooking               0
Bathroom                  0
Balcony                   0
Ownership                 0
dtype: int64

In [168]:
df.shape

(187531, 16)

In [169]:
df.to_csv('/teamspace/studios/this_studio/Data-Science---Practices/data/cleaned_house_prices.csv', index=False)